 IDENTIFICATION DIVISION.
PROGRAM-ID. LOG-ANALYZER.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.

FILE-CONTROL.
    SELECT LOG-FILE ASSIGN TO "system.log"
        ORGANIZATION IS LINE SEQUENTIAL.

    SELECT REPORT-FILE ASSIGN TO "report.txt"
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.

FILE SECTION.

FD LOG-FILE.
01 LOG-RECORD PIC X(10).

FD REPORT-FILE.
01 REPORT-LINE PIC X(50).

WORKING-STORAGE SECTION.

01 EOF-FLAG PIC X VALUE "N".

01 INFO-COUNT PIC 9(5) VALUE 0.
01 ERROR-COUNT PIC 9(5) VALUE 0.
01 WARNING-COUNT PIC 9(5) VALUE 0.

PROCEDURE DIVISION.

MAIN-PROGRAM.

    OPEN INPUT LOG-FILE
    OPEN OUTPUT REPORT-FILE

    PERFORM UNTIL EOF-FLAG = "Y"

        READ LOG-FILE
            AT END
                MOVE "Y" TO EOF-FLAG
            NOT AT END
                PERFORM PROCESS-LOG
        END-READ

    END-PERFORM

    PERFORM WRITE-REPORT

    CLOSE LOG-FILE
    CLOSE REPORT-FILE

    DISPLAY "Log analysis completed successfully".

    STOP RUN.


PROCESS-LOG.

    EVALUATE LOG-RECORD
        WHEN "INFO"
            ADD 1 TO INFO-COUNT
        WHEN "ERROR"
            ADD 1 TO ERROR-COUNT
        WHEN "WARNING"
            ADD 1 TO WARNING-COUNT
        WHEN OTHER
            CONTINUE
    END-EVALUATE.


WRITE-REPORT.

    MOVE "SYSTEM LOG REPORT" TO REPORT-LINE
    WRITE REPORT-LINE

    MOVE SPACES TO REPORT-LINE
    WRITE REPORT-LINE

    MOVE "INFO EVENTS: " TO REPORT-LINE
    WRITE REPORT-LINE
    MOVE INFO-COUNT TO REPORT-LINE
    WRITE REPORT-LINE

    MOVE "WARNING EVENTS: " TO REPORT-LINE
    WRITE REPORT-LINE
    MOVE WARNING-COUNT TO REPORT-LINE
    WRITE REPORT-LINE

    MOVE "ERROR EVENTS: " TO REPORT-LINE
    WRITE REPORT-LINE
    MOVE ERROR-COUNT TO REPORT-LINE
    WRITE REPORT-LINE.
