       IDENTIFICATION DIVISION.
       PROGRAM-ID. BANK-SYSTEM.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ACCOUNT-FILE ASSIGN TO "accounts.dat"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD ACCOUNT-FILE.
       01 ACCOUNT-RECORD.
           05 ACCT-ID    PIC 9(4).
           05 FILLER     PIC X.
           05 ACCT-BAL   PIC S9(7).

       WORKING-STORAGE SECTION.
       01 WS-ACCOUNTS.
          05 WS-ACCOUNT OCCURS 100 TIMES.
             10 WS-ID    PIC 9(4) VALUE 0.
             10 WS-BAL   PIC S9(7) VALUE 0.
       01 WS-COUNT       PIC 99 VALUE 0.
       01 WS-OPTION      PIC 9.
       01 WS-INPUT-ID    PIC 9(4).
       01 WS-AMOUNT      PIC 9(5).
       01 I              PIC 99.
       01 FOUND          PIC X.
       01 FOUND-INDEX    PIC 99 VALUE 0.

       PROCEDURE DIVISION.

MAIN-PROGRAM.

    PERFORM LOAD-DATA

    PERFORM UNTIL WS-OPTION = 4

        PERFORM SHOW-MENU
        ACCEPT WS-OPTION

        EVALUATE WS-OPTION
            WHEN 1 PERFORM LIST-ACCOUNTS
            WHEN 2 PERFORM DEPOSIT
            WHEN 3 PERFORM WITHDRAW
            WHEN 4 DISPLAY "EXITING..."
            WHEN OTHER DISPLAY "INVALID OPTION"
        END-EVALUATE

    END-PERFORM

    PERFORM SAVE-DATA

    DISPLAY "DATA SAVED. PROGRAM ENDED."
    STOP RUN.


LOAD-DATA.
    OPEN INPUT ACCOUNT-FILE
    MOVE 0 TO WS-COUNT
    PERFORM UNTIL WS-COUNT >= 100
        READ ACCOUNT-FILE
            AT END
                EXIT PERFORM
            NOT AT END
                ADD 1 TO WS-COUNT
                MOVE ACCT-ID TO WS-ID(WS-COUNT)
                MOVE ACCT-BAL TO WS-BAL(WS-COUNT)
        END-READ
    END-PERFORM
    CLOSE ACCOUNT-FILE.

SAVE-DATA.
    OPEN OUTPUT ACCOUNT-FILE
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > WS-COUNT
        MOVE WS-ID(I) TO ACCT-ID
        MOVE WS-BAL(I) TO ACCT-BAL
        WRITE ACCOUNT-RECORD
    END-PERFORM
    CLOSE ACCOUNT-FILE.


SHOW-MENU.
    DISPLAY " "
    DISPLAY "===== BANK SYSTEM ====="
    DISPLAY "1 - LIST ACCOUNTS"
    DISPLAY "2 - DEPOSIT"
    DISPLAY "3 - WITHDRAW"
    DISPLAY "4 - EXIT"
    DISPLAY "OPTION: ".


LIST-ACCOUNTS.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > WS-COUNT
        DISPLAY "ACCOUNT: " WS-ID(I)
                " BALANCE: " WS-BAL(I)
    END-PERFORM.

DEPOSIT.
    DISPLAY "ACCOUNT ID: "
    ACCEPT WS-INPUT-ID
    DISPLAY "AMOUNT: "
    ACCEPT WS-AMOUNT

    PERFORM FIND-ACCOUNT

    IF FOUND = 'Y'
        ADD WS-AMOUNT TO WS-BAL(FOUND-INDEX)
        DISPLAY "DEPOSIT SUCCESS"
    ELSE
        DISPLAY "ACCOUNT NOT FOUND"
    END-IF.


WITHDRAW.
    DISPLAY "ACCOUNT ID: "
    ACCEPT WS-INPUT-ID
    DISPLAY "AMOUNT: "
    ACCEPT WS-AMOUNT

    PERFORM FIND-ACCOUNT

    IF FOUND = 'Y'
        SUBTRACT WS-AMOUNT FROM WS-BAL(FOUND-INDEX)
        DISPLAY "WITHDRAW SUCCESS"
    ELSE
        DISPLAY "ACCOUNT NOT FOUND"
    END-IF.

FIND-ACCOUNT.
    MOVE 'N' TO FOUND
    MOVE 0 TO FOUND-INDEX
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > WS-COUNT OR FOUND = 'Y'
        IF WS-ID(I) = WS-INPUT-ID
            MOVE 'Y' TO FOUND
            MOVE I TO FOUND-INDEX
        END-IF
    END-PERFORM.
